/*=============================================================================

		デバッグ文字表示[ DebugFont.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2017/06/21
------------------------------------------------------------------------------- 
	■　更新日
		2017/08/18
=============================================================================*/

#ifndef _DEBUGFONT_H_
#define _DEBUGFONT_H_

/*-----------------------------------------------------------------------------
	クラス
-----------------------------------------------------------------------------*/
class CDebugFont
{
public:
	static void Init(void);		//	初期化
	static void Uninit(void);	//	終了
	static void Draw(void);		//	描画

	static void ClarText(void);			//	文字の消去
	static void AddText(char *Text);	//	文字の追加

private:
	static char m_Text[1024];

	static LPD3DXFONT m_Font;	// フォントへのポインタ
};
#endif
