/*=============================================================================

		フェードロゴ[ FadeLogo.cpp ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2017/07/20
------------------------------------------------------------------------------- 
	■　更新日
		2017/08/27
=============================================================================*/

/*-----------------------------------------------------------------------------
	ヘッダファイル
-----------------------------------------------------------------------------*/
#include "DirectX.h"
#include "TextureManager.h"
#include "Scene.h"
#include "Sprite2D.h"
#include "FadeLogo.h"

/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/
#define FADE_RATE ( 1.0f / 60 )	//	どのくらいでフェードさせるのか

/*-----------------------------------------------------------------------------
関数名:		CFadeRogo::CFadeRogo(int Priolity)
引数:		int Priolity	優先度
戻り値:
説明:		コンストラクタ
-----------------------------------------------------------------------------*/
CFadeRogo::CFadeRogo(int Priolity) :CSprite2D(Priolity)
{
	m_Color = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);	//	色
	m_UplimitFade = 0.0f;	//	フェードの上限値
	m_LowerFade = 0.0f;		//	フェードの下限値
	m_FadeFlag = true;		//	フェードフラグ

	m_Fade = FADE_IN;
}

/*-----------------------------------------------------------------------------
関数名:		CFadeRogo* CFadeRogo::Create(int Priolity)
引数:		int Priolity	優先度
戻り値:
説明:		生成
-----------------------------------------------------------------------------*/
CFadeRogo* CFadeRogo::Create(int Priolity)
{
	CFadeRogo* faderogo;

	faderogo = new CFadeRogo(Priolity);

	faderogo->Init();

	return faderogo;
}

/*-----------------------------------------------------------------------------
関数名:		void CFadeRogo::Update(void)
引数:
戻り値:
説明:		更新
-----------------------------------------------------------------------------*/
void CFadeRogo::Update(void)
{
	if (m_FadeFlag)
	{
		if (m_Fade == FADE_IN)
		{	//	フェードイン時の処理


			m_Color.a -= FADE_RATE;	//	a値を減算して後ろの画面を浮かび上がらせる

			if (m_Color.a < m_LowerFade)
			{	//	フェードインの終了

				m_Color.a = m_LowerFade;
				m_Fade = FADE_OUT;

			}
		}


		else if (m_Fade == FADE_OUT)
		{	//	フェードアウト時の処理

			m_Color.a += FADE_RATE;	//	a値を加算して後ろの画面を消していく


			if (m_Color.a > m_UplimitFade)
			{	//	フェードアウトの終了

				m_Color.a = m_UplimitFade;
				m_Fade = FADE_IN;	//	フェードインに処理の切り替え

			}
		}
	}

	CSprite2D::SetColor(m_Color);

	CSprite2D::Update();
}