/*=============================================================================

		ゲームループ[ GameLoop.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2017/08/24
------------------------------------------------------------------------------- 
	■　更新日
		2017/08/27
=============================================================================*/

#ifndef _GAMELOOP_H_
#define _GAMELOOP_H_

/*-----------------------------------------------------------------------------
	ヘッダファイル
-----------------------------------------------------------------------------*/
#include <Windows.h>

/*-----------------------------------------------------------------------------
	前方宣言
-----------------------------------------------------------------------------*/
class CManager;	//	マネージャ

/*-----------------------------------------------------------------------------
	クラス
-----------------------------------------------------------------------------*/
class CGameLoop
{
public:
	static void Init(HINSTANCE hInstance, HWND hWnd);	//	初期化
	static void ClockFps(void);	//	FPS計測
	static void Uninit(void);	//	終了

	static const int GetFPS(void){ return m_nCountFPS; }	//	FPS取得

private:
	static DWORD m_dwFrameCount;
	static DWORD m_dwCurrentTime;	//	現在の時間
	static DWORD m_dwExecLastTime;	//	現在の時刻をミリ単位で取得
	static DWORD m_dwFPSLastTime;
	static int m_nCountFPS;			//	FPSカウンタ

	static CManager* m_Manager;		//	マネージャ
};
#endif
