/*=============================================================================

		ウェーブ[ Wave.cpp ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2017/08/30
------------------------------------------------------------------------------- 
	■　更新日
		2017/08/30
=============================================================================*/

/*-----------------------------------------------------------------------------
	ヘッダファイル
-----------------------------------------------------------------------------*/
#include "DirectX.h"
#include "TextureManager.h"
#include "Scene.h"
#include "Number2D.h"
#include "KillCont.h"

/*-----------------------------------------------------------------------------
	マクロ定義
-----------------------------------------------------------------------------*/
#define TEX_ID CTextureManager::TEX_NUMBER

/*-----------------------------------------------------------------------------
 関数名:	CKillCount* CKillCount::Create(D3DXVECTOR2 pos, D3DXVECTOR2 size)
 引数:		D3DXVECTOR2 pos		座標
			D3DXVECTOR2 size	大きさ
 戻り値:	
 説明:		生成
-----------------------------------------------------------------------------*/
CKillCount* CKillCount::Create(D3DXVECTOR2 pos, D3DXVECTOR2 size)
{
	CKillCount* wave;

	wave = new CKillCount(3);

	wave->m_Pos = pos;

	wave->m_Size = size;

	wave->Init();

	return wave;
}

/*-----------------------------------------------------------------------------
関数名:		void CKillCount::Init(void)
引数:
戻り値:
説明:		初期化
-----------------------------------------------------------------------------*/
void CKillCount::Init(void)
{
	for (int i = 0; i < 2; i++)
	{
		m_Number[i] = CNumber2D::Create(m_Pos, m_Size, TEX_ID, i);
	}
}

/*-----------------------------------------------------------------------------
関数名:		void CKillCount::Uninit(void)
引数:
戻り値:
説明:		終了
-----------------------------------------------------------------------------*/
void CKillCount::Uninit(void)
{
	for (int i = 0; i < 2; i++)
	{
		m_Number[i]->Uninit();
		delete m_Number[i];
		m_Number[i] = NULL;
	}

	CScene::Release();	//	オブジェクト自身の解放
}

/*-----------------------------------------------------------------------------
関数名:		void CKillCount::Update(void)
引数:
戻り値:
説明:		更新
-----------------------------------------------------------------------------*/
void CKillCount::Update(void)
{
	int Number;		//	数字を表示する変数
	int TimeValue;	//	値の保持

	//	タイムの保持
	TimeValue = m_KillCount;

	for (int i = 0; i < 2; i++)
	{
		// 数字の設定
		// 各桁の数字の算出
		Number = TimeValue % 10;
		TimeValue /= 10;

		// 各桁の数字の値設定
		m_Number[i]->SetNumber(Number);

		//	ナンバーの更新
		m_Number[i]->Update();
	}
}

/*-----------------------------------------------------------------------------
関数名:		void CKillCount::Draw(void)
引数:
戻り値:
説明:		描画
-----------------------------------------------------------------------------*/
void CKillCount::Draw(void)
{
	for (int i = 0; i < 2; i++)
	{
		m_Number[i]->Draw();
	}
}