/*=============================================================================

		ライト[ Light.cpp ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2017/08/25
------------------------------------------------------------------------------- 
	■　更新日
		2017/08/27
=============================================================================*/

/*-----------------------------------------------------------------------------
	ヘッダファイル
-----------------------------------------------------------------------------*/
#include "DirectX.h"
#include "Light.h"

/*-----------------------------------------------------------------------------
関数名:		CLight::CLight()
引数:
戻り値:
説明:		コンストラクタ
-----------------------------------------------------------------------------*/
CLight::CLight()
{
	//	全て0にする
	ZeroMemory(&m_Light, sizeof(D3DLIGHT9));
}
/*-----------------------------------------------------------------------------
 関数名:	HRESULT CLight::Init(void)
 引数:		
 戻り値:	return S_OK;	成功
 説明:		初期化
-----------------------------------------------------------------------------*/
HRESULT CLight::Init(void)
{
	//	デバイスの取得
	LPDIRECT3DDEVICE9 Device = CDirectX::GetDevice();


	m_Light.Type = D3DLIGHT_DIRECTIONAL;

	//	ディレクショナルライトの色
	m_Light.Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);

	//	アンビエントライトの色
	m_Light.Ambient = D3DXCOLOR(0.5f, 0.0f, 0.5f, 1.0f);

	//	ディレクショナルライトの向き
	D3DXVECTOR3 vecDir(50.0f, -1000.0f, 50.0f);

	//	単位ベクトルにしてlight.Directionに計算結果を代入
	D3DXVec3Normalize((D3DXVECTOR3 *)&m_Light.Direction, &vecDir);

	//	デバイスにライトを設定
	Device->SetLight(0, &m_Light);

	//	ライトをONにする
	Device->LightEnable(0, TRUE);

	//	全体のライトを有効にする
	Device->SetRenderState(D3DRS_LIGHTING, TRUE);

	return S_OK;
}