/*=============================================================================

		モデル管理[ ModelManager.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2017/08/25
------------------------------------------------------------------------------- 
	■　更新日
		2017/08/25
=============================================================================*/

#ifndef _MODELMANAGER_H_
#define _MODELMANAGER_H_

/*-----------------------------------------------------------------------------
	ヘッダファイル
-----------------------------------------------------------------------------*/
#include <unordered_map>

/*-----------------------------------------------------------------------------
	マクロ定義
-----------------------------------------------------------------------------*/
#define MODEL_PATH "data/MODEL/"

/*-----------------------------------------------------------------------------
	クラス
-----------------------------------------------------------------------------*/
class CModelManager
{
public:
	struct MODEL_PARAM
	{
		LPD3DXBUFFER		BuffMat;	//	マテリアル情報
		D3DXMATERIAL		*Mat;		//	マテリアルポインタ
		LPD3DXMESH			Mesh;		//	メッシュ情報
		DWORD				NumMat;		//	マテリアル情報の数
		LPDIRECT3DTEXTURE9	*Texture;	//	テクスチャのポインタ
	};

	void Init(void);	//	初期化
	void UnloadAll(void);	//	全モデルの破棄

	//	Getter
	const MODEL_PARAM GetModelParam(char* Name)const;

private:
	void Load(char* Name);	//	モデルのロード

private:
	MODEL_PARAM m_Model;	//	モデル構造体

	std::unordered_map< char*, MODEL_PARAM > m_Model_Map;
};
#endif
